app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'George Lucas'
---
  def similar
    @movie = Movie.find(params[:id])
    unless @movie.director == ''
      @movies = Movie.find_all_by_director(@movie.director)